data/scalar_verification/ad_1d_Pe1/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1e-08 0 0);

boundaryField
{
    inlet_drug
    {
        type            fixedValue;
        value           uniform (1e-08 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}
